12/data/attachments/bb3d9e9c13c16f15.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_2fd3d9cc-d388-43ad-bd6b-19b33b81e3cb</nif:username>
            <nif:friendToBeAdded>Mary_wait_Friend_94709_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>